[
  {
    "pytanie": "Which NetBIOS service is used for connection-oriented communication?",
    "opcje": [
      "NetBIOS-NS",
      "NetBIOS-DGM",
      "NetBIOS-SSN",
      "LLMNR"
    ],
    "poprawna": "NetBIOS-SSN"
  },
  {
    "pytanie": "Match the port type and number with the respective NetBIOS protocol service.",
    "opcje": [
      "randomization of ports",
      "provision of cryptographically secure DNS transaction identifiers",
      "exclusion of any trust relationships between DNS servers",
      "secure DNS data authentication",
      "prevention of any recursive DNS queries"
    ],
    "poprawna": [
      "randomization of ports",
      "provision of cryptographically secure DNS transaction identifiers"
    ]
  },
  {
    "pytanie": "What two features are present on DNS servers using BIND 9.5.0 and higher that help mitigate DNS cache\n        poisoning attacks? (Choose two.)",
    "opcje": [
      "randomization of ports",
      "provision of cryptographically secure DNS transaction identifiers",
      "exclusion of any trust relationships between DNS servers",
      "secure DNS data authentication",
      "prevention of any recursive DNS queries"
    ],
    "poprawna": [
      "randomization of ports",
      "provision of cryptographically secure DNS transaction identifiers"
    ]
  },
  {
    "pytanie": "What UDP port number is used by SNMP protocol?",
    "opcje": [
      "161",
      "182",
      "128",
      "176"
    ],
    "poprawna": "161"
  },
  {
    "pytanie": "Which is a characteristic of a DNS poisoning attack?",
    "opcje": [
      "The DNS server forward lookup zone is cleared.",
      "The DNS server reverse lookup zone is cleared.",
      "The DNS resolver cache is manipulated.",
      "The DNS server IP address is changed."
    ],
    "poprawna": "The DNS resolver cache is manipulated."
  },
  {
    "pytanie": "Which Kali Linux tool or script can gather information on devices configured for SNMP?",
    "opcje": [
      "snmp-check",
      "nslookup",
      "snmp-brute.nse",
      "snmp-netstat.nse"
    ],
    "poprawna": "snmp-check"
  },
  {
    "pytanie": "Match the SMTP command with the respective description.",
    "opcje": [
      "limit anonymous logins to a select group of people",
      "edit the hosts file to limit the number of authorized DNS servers",
      "use encryption at rest",
      "consolidate all back-end databases on the FTP server",
      "require re-authentication of inactive sessions"
    ],
    "poprawna": [
      "use encryption at rest",
      "require re-authentication of inactive sessions"
    ]
  },
  {
    "pytanie": "Which two best practices would help mitigate FTP server abuse and attacks? (Choose two.)",
    "opcje": [
      "limit anonymous logins to a select group of people",
      "edit the hosts file to limit the number of authorized DNS servers",
      "use encryption at rest",
      "consolidate all back-end databases on the FTP server",
      "require re-authentication of inactive sessions"
    ],
    "poprawna": [
      "use encryption at rest",
      "require re-authentication of inactive sessions"
    ]
  },
  {
    "pytanie": "Which is a characteristic of the pass-the-hash attack?",
    "opcje": [
      "capture of a password hash (as opposed to the password characters) and using the same\n        hashed value for authentication and lateral access to other networked systems",
      "reverse engineering of the captured hash password and using the unencrypted password for authentication and\n        lateral access to other networked systems",
      "compromise of a SAM file and extraction of the password characters to use for authentication and lateral access\n        to other networked systems",
      "capture of the Windows password before the Kerberos hashing function and use of the unencrypted password for\n        authentication and lateral access to other networked systems"
    ],
    "poprawna": "capture of a password hash (as opposed to the password characters) and using the same\n        hashed value for authentication and lateral access to other networked systems"
  },
  {
    "pytanie": "What is a Kerberoasting attack?",
    "opcje": [
      "It is an attempt to steal the hash value of a user credential and use it to create a new user session on the\n        same network.",
      "It attempts to manipulate Kerberos tickets based on available hashes by compromising a vulnerable system and\n        obtaining the local user credentials and password hashes.",
      "It is a post-exploitation attempt that is used to extract service account credential\n        hashes from Active Directory for offline cracking.",
      "It attempts to manipulate data being transferred by performing data corruption or modification."
    ],
    "poprawna": "It is a post-exploitation attempt that is used to extract service account credential\n        hashes from Active Directory for offline cracking."
  },
  {
    "pytanie": "Match the attack type with the respective description.",
    "opcje": [
      "Airmon-ng",
      "nmap",
      "POODLE",
      "EMPIRE"
    ],
    "poprawna": "Airmon-ng"
  },
  {
    "pytanie": "Match the attack type with the respective description.",
    "opcje": [
      "Airmon-ng",
      "nmap",
      "POODLE",
      "EMPIRE"
    ],
    "poprawna": "Airmon-ng"
  },
  {
    "pytanie": "Which tool can be used to perform a Disassociation attack?",
    "opcje": [
      "Airmon-ng",
      "nmap",
      "POODLE",
      "EMPIRE"
    ],
    "poprawna": "Airmon-ng"
  },
  {
    "pytanie": "Which is a characteristic of a Bluesnarfing attack?",
    "opcje": [
      "An attack that is launched using common social engineering attacks, such as phishing attacks, can be performed\n        by impersonating a wireless AP or a captive portal to convince a user to enter the user credentials.",
      "An attack that can be performed using Bluetooth with vulnerable devices in range. It is commonly performed as\n        spam over Bluetooth connections using the OBEX protocol.",
      "An attack that can be performed using Bluetooth with vulnerable devices in range. This\n        attack actually steals information from the device of the victim.",
      "An attack involves modifying BLE messages between systems that would lead them to believe that they are\n        communicating with legitimate systems."
    ],
    "poprawna": "An attack that can be performed using Bluetooth with vulnerable devices in range. This\n        attack actually steals information from the device of the victim."
  },
  {
    "pytanie": "Which Wi-Fi protocol is most vulnerable to a brute-force attack during a Wi-Fi network\n        deployment?",
    "opcje": [
      "WPA2-EAP",
      "WPS",
      "WPA3",
      "WPA2-TKIP"
    ],
    "poprawna": "WPS"
  },
  {
    "pytanie": "What does the MFP feature in the 802.11w standard do to protect against wireless attacks?",
    "opcje": [
      "It uses a PNL to maintain a list of trusted or preferred wireless networks.",
      "It uses a captive portal for all wireless associations.",
      "It inserts the 802.1q tag to protect the wireless frame.",
      "It helps defend against deauthentication attacks."
    ],
    "poprawna": "It helps defend against deauthentication attacks."
  },
  {
    "pytanie": "What is a DNS resolver cache on a Windows system?",
    "opcje": [
      "It is a database of all WINS records.",
      "It is a static database entry of all forward and reverse lookup zones.",
      "It is a temporary database that contains records of all the recent visits and attempted\n        visits to websites and other internet domains.",
      "It is a collective database of all Domain Name Service records of static and cached entries."
    ],
    "poprawna": "It is a temporary database that contains records of all the recent visits and attempted\n        visits to websites and other internet domains."
  },
  {
    "pytanie": "Match the TCP port number with the respective email protocol that uses it.",
    "opcje": [
      "25",
      "110",
      "143",
      "993"
    ],
    "poprawna": "25"
  },
  {
    "pytanie": "Which is the default TCP port used in SMTP for non-encrypted communications?",
    "opcje": [
      "25",
      "110",
      "143",
      "993"
    ],
    "poprawna": "25"
  },
  {
    "pytanie": "What is a characteristic of a Kerberos silver ticket attack?",
    "opcje": [
      "It uses forged service tickets for a given service on a particular server.",
      "It mimics the authentication hash on a particular server.",
      "It acts as the LDAP directory for authentication on a target server.",
      "It coverts the hashed value to the unencrypted value for an authentication attack on a particular server."
    ],
    "poprawna": "It uses forged service tickets for a given service on a particular server."
  },
  {
    "pytanie": "Which attack is a post-exploitation activity that an attacker uses to extract service account credential\n        hashes from Active Directory for offline cracking?",
    "opcje": [
      "MITM",
      "On-Path attack",
      "MAC spoofing",
      "Kerberoasting"
    ],
    "poprawna": "Kerberoasting"
  },
  {
    "pytanie": "Which four items are needed by an attacker to create a silver ticket for a Kerberos silver ticket attack?\n        (Choose four.)",
    "opcje": [
      "hash value",
      "system account",
      "SID",
      "FQDN",
      "target service",
      "DNS forward lookup zone",
      "DNS resolver cache",
      "DNS reverse lookup zone"
    ],
    "poprawna": [
      "system account",
      "SID",
      "FQDN",
      "target service"
    ]
  },
  {
    "pytanie": "Which kind of attack is an IP spoofing attack?",
    "opcje": [
      "On-path",
      "DDoS",
      "Pass-the-Hash",
      "Evil-Twin"
    ],
    "poprawna": "On-path"
  },
  {
    "pytanie": "What is a common mitigation practice for ARP cache poisoning attacks on switches to prevent spoofing of\n        Layer 2 addresses?",
    "opcje": [
      "DHCP snooping",
      "DNSSEC",
      "DAI",
      "BIND 9.5"
    ],
    "poprawna": "DAI"
  },
  {
    "pytanie": "An attacker is launching a reflected DDoS attack in which the response traffic is made up of packets that\n        are much larger than those that the attacker initially sent. Which type of attack is this?",
    "opcje": [
      "downgrade",
      "amplification",
      "on-path",
      "DNS cache poisoning"
    ],
    "poprawna": "amplification"
  }
]
