[
  {
    "pytanie": "Which two statements are true about ASA standard ACLs? (Choose two.)​",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "They identify only the destination IP address.",
      "They are typically only used for OSPF routes."
    ],
    "opcje": [
      "They identify only the destination IP address.",
      "They are the most common type of ACL.",
      "They are applied to interfaces to control traffic.",
      "They specify both the source and destination MAC address.",
      "They are typically only used for OSPF routes."
    ],
    "explanation": "ASA standard ACLs are used to identify the destination IP addresses, unlike IOS\n        ACLs where a standard ACL identifies the source host/network. They are typically only used for OSPF routes and\n        can be used in a route map for OSPF redistribution. Standard access lists cannot be applied to interfaces to\n        control traffic."
  },
  {
    "pytanie": "When dynamic NAT on an ASA is being configured, what two parameters must be specified by network objects?\n        (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "a range of private addresses that will be translated",
      "the pool of public global addresses"
    ],
    "opcje": [
      "the inside NAT interface",
      "the interface security level",
      "the outside NAT interface",
      "a range of private addresses that will be translated",
      "the pool of public global addresses"
    ],
    "explanation": "On an ASA, both the pool of addresses that will be used as inside global address\n        and the range of internal private addresses that should be translated are configured through network objects."
  },
  {
    "pytanie": "Which protocol uses X.509 certificates to support mail protection performed by mail agents?",
    "image": "",
    "type": "choice",
    "poprawna": "S/MIME",
    "opcje": [
      "IPsec",
      "SSL",
      "S/MIME",
      "EAP-TLS"
    ],
    "explanation": "Many applications use the X.509 standard format of digital certificates to\n        authenticate websites, public key distribution, and end devices connected to switch ports. User email agents use\n        the S/MIME protocol to support email protection. S/MIME uses X.509 certificates."
  },
  {
    "pytanie": "What are two security features commonly found in a WAN design? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "firewalls protecting the main and remote sites",
      "VPNs used by mobile workers between sites"
    ],
    "opcje": [
      "WPA2 for data encryption of all data between sites",
      "firewalls protecting the main and remote sites",
      "outside perimeter security including continuous video surveillance",
      "port security on all user-facing ports",
      "VPNs used by mobile workers between sites"
    ],
    "explanation": "WANs span a wide area and commonly have connections from a main site to remote sites\n        including a branch office, regional site, SOHO sites, and mobile workers. WANs typically connect over a public\n        internet connection. Each site commonly has a firewall and VPNs used by remote workers between sites."
  },
  {
    "pytanie": "What is an appropriate use for class 5 digital certificates?",
    "image": "",
    "type": "choice",
    "poprawna": "used for private organizations or government security",
    "opcje": [
      "used for online business transactions between companies",
      "used for private organizations or government security",
      "used by organizations for which proof of identity is required",
      "used for testing in situations in which no checks have been performed"
    ],
    "explanation": "The CA class number determines how rigorous the procedure was that verified the\n        identity of the holder when the certificate was issued. The higher the class number, the more trusted the\n        certificate. Class numbers range from 0 to 5. A class 5 certificate is the most trusted, and class 0 the least\n        trusted. Class 5 is used for private organizations or government security."
  },
  {
    "pytanie": "Which two statements are characteristics of a virus? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "A virus typically requires end-user activation.",
      "A virus can be dormant and then activate at a specific time or\n                date."
    ],
    "opcje": [
      "A virus typically requires end-user activation.",
      "A virus has an enabling vulnerability, a propagation mechanism, and a payload.",
      "A virus replicates itself by independently exploiting vulnerabilities in networks.",
      "A virus provides the attacker with sensitive data, such as passwords.",
      "A virus can be dormant and then activate at a specific time or\n                date."
    ],
    "explanation": "The type of end user interaction required to launch a virus is typically opening an\n        application, opening a web page, or powering on the computer. Once activated, a virus may infect other files\n        located on the computer or other computers on the same network."
  },
  {
    "pytanie": "Match the information security component with the description.",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/2021-10-28_101208.jpg",
    "type": "matching",
    "match_pairs": [],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "Match the security policy with the description. (Not all options are used.)",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/2021-10-28_101455.jpg",
    "type": "matching",
    "match_pairs": [
      {
        "right": "identifies network applications and uses that are acceptable to the organization",
        "left": "acceptable use policy (AUP)"
      },
      {
        "right": "identifies how remote users can access a network and what is accessible via remote connectivity",
        "left": "remote access policy"
      },
      {
        "right": "specifies authorized persons that can have access to network resources and identity verification\n                procedures",
        "left": "identification and authentication policy"
      },
      {
        "right": "specifies network device operating systems and end user application update procedures",
        "left": "network maintenance policy"
      }
    ],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "How does the service password-encryption command enhance password security on Cisco routers and\n        switches?",
    "image": "",
    "type": "choice",
    "poprawna": "It encrypts passwords that are stored in router or switch configuration\n                files.",
    "opcje": [
      "It encrypts passwords as they are sent across the network.",
      "It encrypts passwords that are stored in router or switch configuration\n                files.",
      "It requires that a user type encrypted passwords to gain console access to a router or switch.",
      "It requires encrypted passwords to be used when connecting remotely to a router or switch with Telnet."
    ],
    "explanation": "The service password-encryption command encrypts plaintext passwords in the configuration\n        file so that they cannot be viewed by unauthorized users."
  },
  {
    "pytanie": "Which benefit does SSH offer over Telnet for remotely managing a router?",
    "image": "",
    "type": "choice",
    "poprawna": "encryption",
    "opcje": [
      "encryption",
      "TCP usage",
      "authorization",
      "connections via multiple VTY lines"
    ],
    "explanation": "SSH provides secure access to a network device for remote management. It uses a stronger\n        password authorization than Telnet does and encrypts any data that is transported during the session."
  },
  {
    "pytanie": "Refer to the exhibit. Which statement about the JR-Admin account is true?",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/Which-statement-about-the-JR-Admin-account-is-true.jpg",
    "type": "choice",
    "poprawna": "JR-Admin can issue ping and reload commands.",
    "opcje": [
      "JR-Admin can issue show , ping , and reload commands.",
      "JR-Admin can issue ping and reload commands.",
      "JR-Admin can issue only ping commands.",
      "JR-Admin can issue debug and reload commands.",
      "JR-Admin cannot issue any command because the privilege level does not match one of those defined."
    ],
    "explanation": "When the username name privilege 10 command is issued, access to commands with a privilege\n        level of 10 or less (0-10) is permitted to the user."
  },
  {
    "pytanie": "What protocol is used by SCP for secure transport?",
    "image": "",
    "type": "choice",
    "poprawna": "SSH",
    "opcje": [
      "IPSec",
      "HTTPS",
      "SSH",
      "Telnet",
      "TFTP"
    ],
    "explanation": "The Secure Copy (SCP) feature provides a secure and authenticated method for copying and\n        saving router configuration files by using SSH."
  },
  {
    "pytanie": "Refer to the exhibit. What type of syslog message is displayed?",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/Refer-to-the-exhibit.-What-type-of-syslog-message-is-displayed.png",
    "type": "choice",
    "poprawna": "notification",
    "opcje": [
      "warning",
      "notification",
      "informational",
      "debugging"
    ],
    "explanation": "The severity level is used to provide an explanation for the event or error that is occurring\n        within the Cisco IOS. The smaller the number of the severity level, the more critical the event. A Syslog\n        message with a level 5 is considered a notification message."
  },
  {
    "pytanie": "What command must be issued on a Cisco router that will serve as an authoritative NTP server?",
    "image": "",
    "type": "choice",
    "poprawna": "ntp master 1",
    "opcje": [
      "ntp master 1",
      "ntp server 172.16.0.1",
      "ntp broadcast client",
      "clock set 11:00:00 DEC 20 2010"
    ],
    "explanation": "Routers that will serve as NTP masters must be configured with the ntp master command. A\n        client is configured with the ntp server command so that the client can locate the NTP master. The ntp broadcast\n        client command allows NTP to use to broadcast messages. The clock set command is used to set the time on a\n        router."
  },
  {
    "pytanie": "A server log includes this entry: User student accessed host server ABC using Telnet yesterday for 10\n        minutes. What type of log entry is this?",
    "image": "",
    "type": "choice",
    "poprawna": "accounting",
    "opcje": [
      "authentication",
      "authorization",
      "accounting",
      "accessing"
    ],
    "explanation": "Accounting records what users do and when they do it, including what is accessed, the amount\n        of time the resource is accessed, and any changes that were made. Accounting keeps track of how network\n        resources are used."
  },
  {
    "pytanie": "Which three types of views are available when configuring the role-based CLI access feature? (Choose\n        three.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "root view",
      "superview",
      "CLI view"
    ],
    "opcje": [
      "superuser view",
      "root view",
      "superview",
      "CLI view",
      "admin view",
      "config view"
    ],
    "explanation": "There are three types of Role-based CLI views:\n        1) root view\n        2) CLI view\n        3) superview"
  },
  {
    "pytanie": "What is the purpose of using the ip ospf message-digest-key key md5 password command and the area area-id\n        authentication message-digest command on a router?​",
    "image": "",
    "type": "choice",
    "poprawna": "to configure OSPF MD5 authentication globally on the\n                router​",
    "opcje": [
      "to encrypt OSPF routing updates​",
      "to enable OSPF MD5 authentication on a per-interface basis​",
      "to configure OSPF MD5 authentication globally on the\n                router​",
      "to facilitate the establishment of neighbor adjacencies"
    ],
    "explanation": "To configure OSPF MD5 authentication globally, the ip ospf message-digest-key key md5\n        password interface configuration command and the area area-id authentication message-digest router configuration\n        command are issued. To configure OSPF MD5 authentication per interface, the ip ospf message-digest-key key md5\n        password interface configuration command and the ip ospf authentication message-digest interface configuration\n        command are issued. Authentication does not encrypt OSPF routing updates. The requirements to establish OSPF\n        router neighbor adjacencies are separate from authentication.​"
  },
  {
    "pytanie": "What is indicated by the use of the local-case keyword in a local AAA authentication configuration\n        command sequence?",
    "image": "",
    "type": "choice",
    "poprawna": "that passwords and usernames are case-sensitive",
    "opcje": [
      "that user access is limited to vty terminal lines",
      "that passwords and usernames are case-sensitive",
      "that AAA is enabled globally on the router",
      "that a default local database AAA authentication is applied to all lines"
    ],
    "explanation": "The use of the local-case keyword means that the authentication is case-sensitive. It does\n        not enable or apply the AAA configuration to router interfaces or lines.​"
  },
  {
    "pytanie": "A network administrator is configuring an AAA server to manage RADIUS authentication. Which two features\n        are included in RADIUS authentication? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "hidden passwords during transmission",
      "single process for authentication and authorization"
    ],
    "opcje": [
      "encryption for all communication",
      "hidden passwords during transmission",
      "single process for authentication and authorization",
      "separate processes for authentication and authorization",
      "encryption for only the data"
    ],
    "explanation": "RADIUS authentication supports the following features:RADIUS authentication and authorization\n        as one process\n        Encrypts only the password\n        Utilizes UDP\n        Supports remote-access technologies, 802.1X, and Session Initiation Protocol (SIP)"
  },
  {
    "pytanie": "A network administrator is explaining to a junior colleague the use of the lt and gt keywords when\n        filtering packets using an extended ACL. Where would the lt or gt keywords be used?",
    "image": "",
    "type": "choice",
    "poprawna": "in an IPv4 extended ACL that allows packets from a range of TCP ports\n                destined for a specific network device",
    "opcje": [
      "in an IPv6 extended ACL that stops packets going to one specific destination VLAN",
      "in an IPv4 named standard ACL that has specific UDP protocols that are allowed to be used on a specific server",
      "in an IPv6 named ACL that permits FTP traffic from one particular LAN getting to another LAN",
      "in an IPv4 extended ACL that allows packets from a range of TCP ports\n                destined for a specific network device"
    ],
    "explanation": "The lt and gt keywords are used for defining a range of port numbers that are less than a\n        particular port number or greater than a particular port number."
  },
  {
    "pytanie": "Which feature is unique to IPv6 ACLs when compared to those of IPv4 ACLs?",
    "image": "",
    "type": "choice",
    "poprawna": "an implicit permit of neighbor discovery packets",
    "opcje": [
      "the use of wildcard masks",
      "an implicit deny any any statement",
      "the use of named ACL statements",
      "an implicit permit of neighbor discovery packets"
    ],
    "explanation": "One of the major differences between IPv6 and IPv4 ACLs are two implicit permit statements at\n        the end of any IPv6 ACL. These two permit statements allow neighbor discovery operations to function on the\n        router interface."
  },
  {
    "pytanie": "Refer to the exhibit. An extended access list has been created to prevent human resource users from\n        gaining access to the accounting server. All other network traffic is to be permitted. When following the ACL\n        configuration guidelines, on which router, interface, and direction should the access list be\n        applied?",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/01/2021-01-06_214355.jpg",
    "type": "choice",
    "poprawna": "router R1, interface Gi0/0/0, inbound",
    "opcje": [
      "router R1, interface S0/1/0, outbound",
      "router R2, interface Gi0/0/1, outbound",
      "router R2, interface Gi0/0/1, inbound",
      "router R1, interface Gi0/0/0, inbound",
      "router R2, interface S0/1/1, inbound",
      "router R1, interface Gi0/0/0, outbound"
    ],
    "explanation": "The ACL configuration guidelines recommend placing extended access control lists as close to\n        the source of network traffic as possible and placing standard access control lists as close to the destination\n        of network traffic as possible."
  },
  {
    "pytanie": "Which statement describes the characteristics of packet-filtering and stateful firewalls as they relate\n        to the OSI model?",
    "image": "",
    "type": "choice",
    "poprawna": "A packet-filtering firewall typically can filter up to the transport\n                layer, whereas a stateful firewall can filter up to the session layer.",
    "opcje": [
      "Both stateful and packet-filtering firewalls can filter at the application layer.",
      "A stateful firewall can filter application layer information, whereas a packet-filtering firewall cannot filter\n        beyond the network layer.",
      "A packet-filtering firewall typically can filter up to the transport\n                layer, whereas a stateful firewall can filter up to the session layer.",
      "A packet-filtering firewall uses session layer information to track the state of a connection, whereas a\n        stateful firewall uses application layer information to track the state of a connection."
    ],
    "explanation": "Packet filtering firewalls can always filter Layer 3 content and sometimes TCP and UDP-based\n        content. Stateful firewalls monitor connections and thus have to be able to support up to the session layer of\n        the OSI model."
  },
  {
    "pytanie": "Which special hardware module, when integrated into ASA, provides advanced IPS features?",
    "image": "",
    "type": "choice",
    "poprawna": "Advanced Inspection and Prevention (AIP)",
    "opcje": [
      "Content Security and Control (CSC)",
      "Advanced Inspection and Prevention (AIP)",
      "Advanced Inspection and Prevention Security Services Card (AIP-SSC)",
      "Advanced Inspection and Prevention Security Services Module (AIP-SSM)"
    ],
    "explanation": "The advanced threat control and containment services of an ASA firewall are provided by\n        integrating special hardware modules with the ASA architecture. These special modules include:\n        Advanced Inspection and Prevention (AIP) module – supports advanced IPS capability.\n        Content Security and Control (CSC) module – supports antimalware capabilities.\n        Cisco Advanced Inspection and Prevention Security Services Module (AIP-SSM) and Cisco Advanced Inspection and\n        Prevention Security Services Card (AIP-SSC) – support protection against tens of thousands of known exploits."
  },
  {
    "pytanie": "Refer to the exhibit. A network administrator is configuring the security level for the ASA. What is a\n        best practice for assigning the security level on the three interfaces?",
    "image": "https://itexamanswers.net/wp-content/uploads/2016/02/ccnasec4.png",
    "type": "choice",
    "poprawna": "Outside 0, Inside 100, DMZ 50",
    "opcje": [
      "Outside 0, Inside 35, DMZ 90",
      "Outside 40, Inside 100, DMZ 0",
      "Outside 0, Inside 100, DMZ 50",
      "Outside 100, Inside 10, DMZ 40"
    ],
    "explanation": "The Cisco ASA assigns security levels to distinguish among different networks it connects.\n        Security levels define the level of trustworthiness of an interface. The higher the level, the more trusted the\n        interface. The security level numbers range between 0 (untrustworthy) to 100 (very trustworthy). Therefore, the\n        interface connecting to the Internet should be assigned the lowest level. The interface connecting to the\n        internal network should be assigned the highest level. The interface connecting to the DMZ network should be\n        assigned a level between them."
  },
  {
    "pytanie": "What is an advantage in using a packet filtering firewall versus a high-end firewall appliance?",
    "image": "",
    "type": "choice",
    "poprawna": "Packet filters perform almost all the tasks of a high-end firewall at a\n                fraction of the cost.",
    "opcje": [
      "Packet filters perform almost all the tasks of a high-end firewall at a\n                fraction of the cost.",
      "Packet filters represent a complete firewall solution.",
      "Packet filters are not susceptible to IP spoofing.",
      "Packet filters provide an initial degree of security at the data-link and network layer."
    ],
    "explanation": "There are several advantages of using a packet filtering firewall:\n        – ​allows for implementing simple permit or deny rule sets.\n        – has a low impact on network performance\n        – is easy to implement, and is supported by most routers\n        – provides an initial degree of security at the network layer\n        – performs almost all the tasks of a high-end firewall at a much lower cost"
  },
  {
    "pytanie": "Which type of firewall is commonly part of a router firewall and allows or blocks traffic based on Layer\n        3 and Layer 4 information?",
    "image": "",
    "type": "choice",
    "poprawna": "stateless firewall",
    "opcje": [
      "stateless firewall",
      "stateful firewall",
      "proxy firewall",
      "application gateway firewall"
    ],
    "explanation": "A stateless firewall uses a simple policy table look-up that filters traffic based on\n        specific criteria. These firewalls are usually part of a router firewall. They permit or deny traffic based on\n        Layer 3 and Layer 4 information."
  },
  {
    "pytanie": "A company is deploying a new network design in which the border router has three interfaces. Interface\n        Serial0/0/0 connects to the ISP, GigabitEthernet0/0 connects to the DMZ, and GigabitEthernet/01 connects to the\n        internal private network. Which type of traffic would receive the least amount of inspection (have the most\n        freedom of travel)?",
    "image": "",
    "type": "choice",
    "poprawna": "traffic that is going from the private network to the DMZ",
    "opcje": [
      "traffic that is going from the private network to the DMZ",
      "traffic that originates from the public network and that is destined for the DMZ",
      "traffic that is returning from the DMZ after originating from the private network",
      "traffic that is returning from the public network after originating from the private network"
    ],
    "explanation": "Most traffic within an organization originates from a private IP address. The amount of\n        inspection done to that traffic depends on its destination or whether traffic that is going to that private IP\n        address originated the connection. The demilitarized zone typically holds servers. Traffic that is destined to\n        those servers is filtered based on what services are being provided by the server (HTTP, HTTPS, DNS, etc.)."
  },
  {
    "pytanie": "What are two benefits offered by a zone-based policy firewall on a Cisco router? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "Policies are applied to unidirectional traffic between zones.",
      "Policies provide scalability because they are easy to read and\n                troubleshoot."
    ],
    "opcje": [
      "Policies are defined exclusively with ACLs.",
      "Policies are applied to unidirectional traffic between zones.",
      "Policies provide scalability because they are easy to read and\n                troubleshoot.",
      "Any interface can be configured with both a ZPF and an IOS Classic Firewall.",
      "Virtual and physical interfaces are put in different zones to enhance security."
    ],
    "explanation": "There are several benefits of a ZPF:\n        It is not dependent on ACLs.\n        The router security posture is to block unless explicitly allowed.\n        Policies are easy to read and troubleshoot. This provides scalability because one policy affects any given\n        traffic, instead of needing multiple ACLs and inspection actions for different types of traffic.\n        Virtual and physical interfaces can be grouped into zones.\n        Policies are applied to unidirectional traffic between zones.\n        Both IOS Classic Firewalls and ZPFs can be enabled concurrently on a Cisco router. However, the models cannot be\n        combined on a single interface."
  },
  {
    "pytanie": "When a Cisco IOS Zone-Based Policy Firewall is being configured via CLI, which step must be taken after\n        zones have been created?",
    "image": "",
    "type": "choice",
    "poprawna": "Establish policies between zones.",
    "opcje": [
      "Design the physical infrastructure.",
      "Establish policies between zones.",
      "Identify subsets within zones.",
      "Assign interfaces to zones."
    ],
    "explanation": "The steps for configuring zones in a Zone-Based Policy Firewall are as follows:\n        – Step 1. Determine the zones.\n        – Step 2. Establish policies between zones.\n        – Step 3. Design the physical infrastructure.\n        – Step 4. Identify subsets within zones and merge traffic requirements.​"
  },
  {
    "pytanie": "What are two shared characteristics of the IDS and the IPS? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "Both are deployed as sensors.",
      "Both use signatures to detect malicious traffic."
    ],
    "opcje": [
      "Both are deployed as sensors.",
      "Both analyze copies of network traffic.",
      "Both use signatures to detect malicious traffic.",
      "Both have minimal impact on network performance.​",
      "Both rely on an additional network device to respond to malicious traffic."
    ],
    "explanation": "Both the IDS and the IPS are deployed as sensors and use signatures to detect malicious\n        traffic. The IDS analyzes copies of network traffic, which results in minimal impact on network performance. The\n        IDS also relies on an IPS to stop malicious traffic. ​​"
  },
  {
    "pytanie": "When a Cisco IOS Zone-Based Policy Firewall is being configured, which two actions can be applied to a\n        traffic class? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "drop",
      "inspect"
    ],
    "opcje": [
      "log",
      "hold",
      "drop",
      "inspect",
      "copy",
      "forward"
    ],
    "explanation": "The three actions that can be applied are inspect, drop,and pass.​\n        Inspect – This action offers state-based traffic control.\n        Drop – This is the default action for all traffic. Similar to the implicit deny any at the end of every ACL,\n        there is an explicit drop applied by the IOS to the end of every policy map.\n        Pass – This action allows the router to forward traffic from one zone to another."
  },
  {
    "pytanie": "Match the network security device type with the description.",
    "image": "https://itexamanswers.net/wp-content/uploads/2020/09/Match-the-network-security-device-type-with-the-description.jpg",
    "type": "matching",
    "match_pairs": [],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "What is a characteristic of an IPS atomic signature?",
    "image": "",
    "type": "choice",
    "poprawna": "it is the simplest type of signature",
    "opcje": [
      "it can be slow and inefficient to analyze traffic",
      "it requires several pieces of data to match an attack",
      "it is a stateful signature",
      "it is the simplest type of signature"
    ],
    "explanation": "There are two types of IPS signatures:\n        Atomic – This is the simplest type of signature because it does not require the IPS to maintain state\n        information and it can identify an attack with a single packet, activity, or event.\n        Composite – This is a stateful type of signature. It requires that the IPS maintain state information to match\n        an attack signature."
  },
  {
    "pytanie": "Match each IPS signature trigger category with the description.",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/2021-10-28_102250.jpg",
    "type": "matching",
    "match_pairs": [],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "A company is concerned about data theft if any of the corporate laptops are stolen. Which Windows tool\n        would the company use to protect the data on the laptops?",
    "image": "",
    "type": "choice",
    "poprawna": "BitLocker",
    "opcje": [
      "AMP",
      "802.1X",
      "RADIUS",
      "BitLocker"
    ],
    "explanation": "Storage devices can be encrypted to protect data from unauthorized access. Windows BitLocker\n        provides drive encryption."
  },
  {
    "pytanie": "What protocol is used to encapsulate the EAP data between the authenticator and authentication server\n        performing 802.1X authentication?",
    "image": "",
    "type": "choice",
    "poprawna": "RADIUS",
    "opcje": [
      "RADIUS",
      "TACACS+",
      "SSH",
      "MD5"
    ],
    "explanation": "Encapsulation of EAP data between the authenticator and the authentication server is\n        performed using RADIUS."
  },
  {
    "pytanie": "A company requires the use of 802.1X security. What type of traffic can be sent if the authentication\n        port-control auto command is configured, but the client has not yet been authenticated?",
    "image": "",
    "type": "choice",
    "poprawna": "EAPOL",
    "opcje": [
      "SNMP",
      "EAPOL",
      "broadcasts such as ARP",
      "any data encrypted with 3DES or AES"
    ],
    "explanation": "802.1X prevents unauthorized devices from gaining access to the network. The authentication\n        port-control auto command turns on 802.1X access control. Until the client is authenticated, 802.1X only allows\n        Extensible Authentication Protocol over LAN (EAPOL), Cisco Discovery Protocol (CDP), and Spanning Tree Protocol\n        (STP) traffic to pass through the port. EAPOL messages are sent between the client and the authenticator such as\n        a switch. If authentication is successful, normal traffic can be sent and received through the port."
  },
  {
    "pytanie": "Which two security features can cause a switch port to become error-disabled? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "PortFast with BPDU guard enabled",
      "port security with the shutdown violation mode"
    ],
    "opcje": [
      "root guard",
      "PortFast with BPDU guard enabled",
      "protected ports",
      "storm control with the trap option",
      "port security with the shutdown violation mode"
    ],
    "explanation": "Error-disabled mode is a way for a switch to automatically shut down a port that is causing\n        problems, and usually requires manual intervention from an administrator to restore the port. When port security\n        is configured to use the shutdown violation mode, it will put the port into the error-disabled mode when the\n        maximum number of MAC addresses is exceeded. Likewise, BPDU guard will put the port into error-disabled mode if\n        a BPDU arrives on a PortFast enabled interface. Storm control will only put the port into the error-disabled\n        mode when configured with the shutdown option. The trap option will simply create an SNMP log message."
  },
  {
    "pytanie": "What are three techniques for mitigating VLAN hopping attacks? (Choose three.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "Disable DTP.",
      "Enable trunking manually.",
      "Set the native VLAN to an unused VLAN."
    ],
    "opcje": [
      "Disable DTP.",
      "Enable trunking manually.",
      "Set the native VLAN to an unused VLAN.",
      "Enable BPDU guard.",
      "Enable Source Guard.",
      "Use private VLANs."
    ],
    "explanation": "Mitigating a VLAN hopping attack can be done by disabling Dynamic Trunking Protocol (DTP),\n        manually setting ports to trunking mode, and by setting the native VLAN of trunk links to VLANs not in use."
  },
  {
    "pytanie": "Refer to the exhibit. A network administrator is configuring DAI on switch SW1. What is the result of\n        entering the exhibited commands?",
    "image": "https://itexamanswers.net/wp-content/uploads/2020/06/What-is-the-result-of-entering-the-exhibited-commands.jpg",
    "type": "choice",
    "poprawna": "DAI will validate only the destination MAC addresses.",
    "opcje": [
      "DAI will validate both source and destination MAC addresses as well as the IP addresses in the order specified.\n        If all parameters are valid then the ARP packet is allowed to pass.",
      "DAI will validate both source and destination MAC addresses as well as the IP addresses in the order specified.\n        When one set of parameters are valid, the ARP packet is allowed to pass.",
      "DAI will validate only the destination MAC addresses.",
      "DAI will validate only the IP addresses."
    ],
    "explanation": "DAI can be configured to check for destination MAC, source MAC, and IP addresses. However,\n        only one ip arp inspection validate command can be configured. Entering multiple ip arp inspection validate\n        commands overwrites the previous command."
  },
  {
    "pytanie": "During a recent pandemic, employees from ABC company were allowed to work from home. What security\n        technology should be implemented to ensure that data communications between the employees and the ABC Head\n        Office network remain confidential?",
    "image": "",
    "type": "choice",
    "poprawna": "a symmetric or asymmetric encryption algorithm such as AES or\n                PKI",
    "opcje": [
      "a symmetric or asymmetric encryption algorithm such as AES or\n                PKI",
      "a hashing algorithm such as MD5",
      "a hash message authentication code such as HMAC",
      "a hash-generating algorithm such as SHA"
    ],
    "explanation": "MD5 and SHA are hash-generating algorithms that guarantee that no one intercepted the message\n        and altered it. Advanced Encryption Standard (AES) is a popular symmetric encryption algorithm where each\n        communicating party needs to know the pre-shared key. Public key infrastructure (PKI) is an asymmetric\n        encryption algorithm based on the assumption that the two communicating parties have not previously shared a\n        secret key. HMAC is a hash message authentication code that guarantees that the message is not a forgery and\n        actually comes from the authentic source."
  },
  {
    "pytanie": "Which cipher played a significant role in World War II?",
    "image": "",
    "type": "choice",
    "poprawna": "Enigma",
    "opcje": [
      "RC4",
      "Caesar",
      "Enigma",
      "One-time pad"
    ],
    "explanation": "The Enigma machine was an electromechanical encryption device that created the Enigma cipher\n        and was developed during World War II. The device depended on the distribution of pre-shared keys that were used\n        to encrypt and decrypt messages."
  },
  {
    "pytanie": "One method used by Cryptanalysts to crack codes is based on the fact that some letters of the English\n        language are used more often than others. Which term is used to describe this method?",
    "image": "",
    "type": "choice",
    "poprawna": "frequency analysis",
    "opcje": [
      "cybertext",
      "meet-in-the-middle",
      "frequency analysis",
      "known-plaintext"
    ],
    "explanation": "Frequency analysis uses the fact that some characters in the English alphabet are used more\n        often than others. The letters E, T, and A are the most popular letters and J, Q, X, and Z are the least\n        popular."
  },
  {
    "pytanie": "Why are DES keys considered weak keys?",
    "image": "",
    "type": "choice",
    "poprawna": "They produce identical subkeys.",
    "opcje": [
      "They are more resource intensive.",
      "DES weak keys are difficult to manage.",
      "They produce identical subkeys.",
      "DES weak keys use very long key sizes."
    ],
    "explanation": "Weak keys, whether part of an existing encryption algorithm or manually generated, reveal\n        regularities in encryption. This creates a shortcut by which a hacker can break the encryption. DES has four\n        keys for which encryption is identical to decryption."
  },
  {
    "pytanie": "Refer to the exhibit. A network administrator is configuring an object group on an ASA device. Which\n        configuration keyword should be used after the object group name SERVICE1 ?",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/A-network-administrator-is-configuring-an-object-group-on-an-ASA-device.jpg",
    "type": "choice",
    "poprawna": "tcp",
    "opcje": [
      "ip",
      "tcp",
      "udp",
      "icmp"
    ],
    "explanation": "Because this is a service object group, the keyword should indicate which protocol is used.\n        The options are tcp, udp, tcp-udp, icmp, and icmpv6. The subsequent commands indicate that the services in the\n        group are WWW, FTP, and SMTP. Because all of these protocols use TCP, the keyword in the service object group\n        should be tcp ."
  },
  {
    "pytanie": "In the implementation of network security, how does the deployment of a Cisco ASA firewall differ from a\n        Cisco IOS router?",
    "image": "",
    "type": "choice",
    "poprawna": "ASA devices support interface security levels.",
    "opcje": [
      "ASA devices use ACLs that are always numbered.",
      "ASA devices do not support an implicit deny within ACLs.",
      "ASA devices support interface security levels.",
      "ASA devices use ACLs configured with a wildcard mask."
    ],
    "explanation": "The differences between ASA devices and Cisco IOS routers include the following:\n        An ASA device configured with ACLs is configured with a subnet mask.\n        An ASA device supports interface security levels.\n        An ASA device configured with an ACL is always named.\nASA devices and Cisco IOS routers are similar in that they both support an implicit deny within an ACL."
  },
  {
    "pytanie": "Refer to the exhibit. A network administrator is configuring PAT on an ASA device to enable internal\n        workstations to access the Internet. Which configuration command should be used next?",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/Which-configuration-command-should-be-used-next.jpg",
    "type": "choice",
    "poprawna": "nat (inside,outside) dynamic interface",
    "opcje": [
      "nat (inside,outside) dynamic NET1",
      "nat (outside,inside) dynamic NET1",
      "nat (inside,outside) dynamic interface",
      "nat (outside,inside) dynamic interface"
    ],
    "explanation": "The nat (inside,outside) dynamic interface command indicates that inside hosts are\n        overloading the outside address of the mapped interface."
  },
  {
    "pytanie": "What type of network security test uses simulated attacks to determine the feasibility of an attack as\n        well as the possible consequences if the attack occurs?",
    "image": "",
    "type": "choice",
    "poprawna": "penetration testing",
    "opcje": [
      "penetration testing",
      "network scanning",
      "integrity checking",
      "vulnerability scanning"
    ],
    "explanation": "There are many tests that are used by security specialists to assess the status of a system.\n        They include the following:\n        penetration testing to determine the feasibility of attacks\n        network scanning to scan for and identify open TCP ports\n        integrity checking to check for changes that have occurred in the system\n        vulnerability scanning to detect potential weaknesses in systems"
  },
  {
    "pytanie": "What three tasks can a network administrator accomplish with the Nmap and Zenmap security testing tools?\n        (Choose three.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "operating system fingerprinting",
      "assessment of Layer 3 protocol support on hosts",
      "open UDP and TCP port detection"
    ],
    "opcje": [
      "operating system fingerprinting",
      "assessment of Layer 3 protocol support on hosts",
      "open UDP and TCP port detection",
      "security event analysis and reporting",
      "password recovery",
      "development of IDS signatures"
    ],
    "explanation": "Nmap is a low-level network scanner that is available to the public and that has the ability\n        to perform port scanning, to identify open TCP and UDP ports, and which can also perform system identification.\n        It can also be used to identify Layer 3 protocols that are running on a system. Zenmap is the GUI version of\n        Nmap."
  },
  {
    "pytanie": "Match the network security testing tool with the correct function. (Not all options are used.)",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/2021-10-28_100937.jpg",
    "type": "matching",
    "match_pairs": [],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "Which two means can be used to try to bypass the management of mobile devices? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "rooting",
      "jailbreaking"
    ],
    "opcje": [
      "using a fuzzer",
      "rooting",
      "jailbreaking",
      "packet sniffing",
      "using a Trojan Horse"
    ],
    "explanation": "Jailbreaking is a term used when breaking into an Apple iOS device, whereas rooting is the\n        term used for doing the same to an Android device. Both must be concerns in the corporate environment where so\n        many people bring their own devices and access the corporate networks."
  },
  {
    "pytanie": "Match the type of cyberattackers to the description. (Not all options are used.)",
    "image": "https://itexamanswers.net/wp-content/uploads/2021/05/2021-10-28_102053.jpg",
    "type": "matching",
    "match_pairs": [],
    "opcje": [],
    "poprawna": [],
    "explanation": ""
  },
  {
    "pytanie": "What is a benefit of having users or remote employees use a VPN to connect to the existing network rather\n        than growing the network infrastructure?",
    "image": "",
    "type": "choice",
    "poprawna": "scalability",
    "opcje": [
      "security",
      "scalability",
      "cost savings",
      "compatibility"
    ],
    "explanation": "A benefit of VPNs is scalability because organizations can use the Internet and easily add\n        new users without adding significant infrastructure. Security is provided by using encryption and authentication\n        protocols to protect data. Another benefit is compatibility because VPNs can be implemented across a wide\n        variety of WAN connections. Organizations also benefit from cost savings because VPNs reduce connectivity costs\n        while simultaneously increasing remote connection bandwidth."
  },
  {
    "pytanie": "What is a difference between symmetric and asymmetric encryption algorithms?",
    "image": "",
    "type": "choice",
    "poprawna": "Symmetric encryption algorithms use pre-shared keys. Asymmetric encryption\n                algorithms use different keys to encrypt and decrypt data.",
    "opcje": [
      "Symmetric algorithms are typically hundreds to thousands of times slower than asymmetric algorithms.",
      "Symmetric encryption algorithms are used to authenticate secure communications. Asymmetric encryption algorithms\n        are used to repudiate messages.",
      "Symmetric encryption algorithms are used to encrypt data. Asymmetric encryption algorithms are used to decrypt\n        data.",
      "Symmetric encryption algorithms use pre-shared keys. Asymmetric encryption\n                algorithms use different keys to encrypt and decrypt data."
    ],
    "explanation": "Asymmetric algorithms can use very long key lengths in order to avoid being hacked. This\n        results in the use of significantly increased resources and time compared to symmetric algorithms."
  },
  {
    "pytanie": "What technology allows users to verify the identity of a website and to trust code that is downloaded\n        from the Internet?",
    "image": "",
    "type": "choice",
    "poprawna": "digital signature",
    "opcje": [
      "asymmetric key algorithm",
      "digital signature",
      "encryption",
      "hash algorithm"
    ],
    "explanation": "Digital signatures provide assurance of the authenticity and integrity of software codes.\n        They provide the ability to trust code that is downloaded from the Internet."
  },
  {
    "pytanie": "Which two statements correctly describe certificate classes used in the PKI? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "A class 0 certificate is for testing purposes.",
      "A class 4 certificate is for online business transactions between\n                companies."
    ],
    "opcje": [
      "A class 0 certificate is for testing purposes.",
      "A class 0 certificate is more trusted than a class 1 certificate.",
      "The lower the class number, the more trusted the certificate.",
      "A class 5 certificate is for users with a focus on verification of email.",
      "A class 4 certificate is for online business transactions between\n                companies."
    ],
    "explanation": "A digital certificate class is identified by a number. The higher the number, the more\n        trusted the certificate. The classes include the following:Class 0 is for testing purposes in which no checks\n        have been performed.\n        Class 1 is for individuals with a focus on verification of email.\n        Class 2 is for organizations for which proof of identity is required.\n        Class 3 is for servers and software signing for which independent verification and checking of identity and\n        authority is done by the issuing certificate authority.\n        Class 4 is for online business transactions between companies.\n        Class 5 is for private organizations or governmental security."
  },
  {
    "pytanie": "What is the standard for a public key infrastructure to manage digital certificates?",
    "image": "",
    "type": "choice",
    "poprawna": "x.509",
    "opcje": [
      "PKI",
      "NIST-SP800",
      "x.503",
      "x.509"
    ],
    "explanation": "The x.509 standard is for a PKI infrastructure and x.500 if for directory structures.​"
  },
  {
    "pytanie": "Which two statements describe remote access VPNs? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "Client software is usually required to be able to access the network.",
      "Remote access VPNs support the needs of telecommuters and mobile\n                users."
    ],
    "opcje": [
      "Remote access VPNs are used to connect entire networks, such as a branch office to headquarters.",
      "End users are not aware that VPNs exists.",
      "A leased line is required to implement remote access VPNs.",
      "Client software is usually required to be able to access the network.",
      "Remote access VPNs support the needs of telecommuters and mobile\n                users."
    ],
    "explanation": "Remote access VPNs are designed to provide for the needs of telecommuters and mobile users\n        through the use of software that is installed on the client to encrypt and encapsulate the data. Remote access\n        VPNs can be used across a variety of WAN connections. Users must access the client software to initiate the VPN\n        connection."
  },
  {
    "pytanie": "What are two hashing algorithms used with IPsec AH to guarantee authenticity? (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "MD5",
      "SHA"
    ],
    "opcje": [
      "MD5",
      "SHA",
      "AES",
      "DH",
      "RSA"
    ],
    "explanation": "The IPsec framework uses various protocols and algorithms to provide data confidentiality,\n        data integrity, authentication, and secure key exchange. Two popular algorithms used to ensure that data is not\n        intercepted and modified (data integrity and authenticity) are MD5 and SHA."
  },
  {
    "pytanie": "What is the purpose of configuring multiple crypto ACLs when building a VPN connection between remote\n        sites?",
    "image": "",
    "type": "choice",
    "poprawna": "When multiple combinations of IPsec protection are being chosen, multiple\n                crypto ACLs can define different traffic types.",
    "opcje": [
      "By applying the ACL on a public interface, multiple crypto ACLs can be built to prevent public users from\n        connecting to the VPN-enabled router.",
      "Multiple crypto ACLs can be configured to deny specific network traffic from crossing a VPN.",
      "When multiple combinations of IPsec protection are being chosen, multiple\n                crypto ACLs can define different traffic types.",
      "Multiple crypto ACLs can define multiple remote peers for connecting with a VPN-enabled router across the\n        Internet or network."
    ],
    "explanation": "A crypto ACL can define “interesting traffic” that is used to build a VPN, and forward that\n        “interesting traffic” across the VPN to another VPN-enabled router. Multiple crypto ACLs are used to define\n        multiple different types of traffic and utilize different IPsec protection corresponding to the different types\n        of traffic."
  },
  {
    "pytanie": "Refer to the exhibit. An administrator creates three zones (A, B, and C) in an ASA that filters traffic.\n        Traffic originating from Zone A going to Zone C is denied, and traffic originating from Zone B going to Zone C\n        is denied. What is a possible scenario for Zones A, B, and C?",
    "image": "https://itexamanswers.net/wp-content/uploads/2016/02/CCNA-Security-Chapter-9-2.png",
    "type": "choice",
    "poprawna": "A – DMZ, B – Outside, C – Inside",
    "opcje": [
      "A – DMZ, B – Inside, C – Outside",
      "A – Inside, B – DMZ, C – Outside",
      "A – Outside, B – Inside, C – DMZ",
      "A – DMZ, B – Outside, C – Inside"
    ],
    "explanation": "ASA protects Network/Zone C (Inside) from unauthorized access by users on a Network/Zone B\n        (Outside). It also denies traffic from Network/Zone A (DMZ) to access the Network/Zone C (Inside)."
  },
  {
    "pytanie": "What are two monitoring tools that capture network traffic and forward it to network monitoring devices?\n        (Choose two.)",
    "image": "",
    "type": "multi-choice",
    "poprawna": [
      "SPAN",
      "network tap"
    ],
    "opcje": [
      "SIEM",
      "Wireshark",
      "SNMP",
      "SPAN",
      "network tap"
    ],
    "explanation": "A network tap is used to capture traffic for monitoring the network. The tap is typically a\n        passive splitting device implemented inline on the network and forwards all traffic including physical layer\n        errors to an analysis device. SPAN is a port mirroring technology supported on Cisco switches that enables the\n        switch to copy frames and forward them to an analysis device."
  },
  {
    "pytanie": "What is the IPS detection engine that is included in the SEC license for 4000 Series ISRs?",
    "image": "",
    "type": "choice",
    "poprawna": "Snort",
    "opcje": [
      "Security Onion",
      "Snort",
      "ASDM",
      "AMP"
    ],
    "explanation": "Snort is the IPS detection and enforcement engine that is included in the SEC license for\n        4000 Series ISRs."
  }
]